let movies = [
    {
        id: 1,
        engname: 'The Beekeeper',
        name: 'Пчеловод',

        src: 'Beekeeperfull.jpg',
        srcfull: "beekeeper.png",
        srcvideo: "1.webm",


        year: '2024',
        country: 'США, Великобритания',
        genres: "Фантастика",
        slogan: '—',
        director: 'Дэвид Эйр', //Режиссер
        script: 'Курт Уиммер', //сценарий
        producer: 'Дэвид Эйр, Билл Блок, Джейсон Стэйтем, ...', // Продюсер
        operator: 'Габриель Беристайн',// Оператор
        composer: 'Джаред Майкл Фрай, Дэвид Сарди',// Композитор
        painter: 'Бен Манро, Мария Криссикос, Кристофер Гай Эванс, ...',// Художник
        mounting: 'Джеффри О’Брайэн',// Монтаж
        budget: '40 000 000 $',
        feesUSA: '66 220 535 $', // Сборы в США
        feesWorld: '+ 86 500 000 $ = 152 720 535 $',   // Сборы в мире
        worldPremiere: '8 января 2024',// Премьера в мире
        age: '16+',
        time: '105 мин. / 01:45',

        acters: "Джейсон Стэйтем-Эмми Рейвер-Лэмпман-Бобби Надери-Джош Хатчерсон-Джереми Айронс-Дэвид Уиттс-Михаэль Эпп-Тейлор Джеймс-Филишия Рашад-Джемма Редгрейв",
        actersN: 44,

        populars: 1,
        views: 1000000,
        rating: 7,
    },
    {
        id: 2,
        engname: 'Free Guy',
        name: 'Главный герой',

        src: 'maingeroi.jpg',
        srcfull: "maingeroifull.jpg",
        srcvideo: "2.webm",

        year: '2021',
        country: 'США, Канада',
        genres: "Фантастика",
        slogan: '«Жизнь слишком коротка, чтобы быть на вторых ролях»',
        director: 'Шон Леви', // Режиссер
        script: 'Зак Пенн, Мэтт Либерман', // Сценарий
        producer: 'Грег Берланти, Дэн Коэн, Джордж Дьюи, ...', // Продюсер
        operator: 'Джордж Ричмонд',// Оператор
        composer: 'Кристоф Бек',// Композитор
        painter: 'Этан Тобман, Стив Купер, Бит Фрутигер, ...',// Художник
        mounting: 'Дин Зиммерман',// Монтаж
        budget: '120 000 000 $',
        feesUSA: '121 626 598 $', // Сборы в США
        feesWorld: '+ 209 900 000 $ = 331 526 598 $',   // Сборы в мире
        audience: '2.8 млн', // Зрители
        feesRussia: '11 429 576 $', // Сборы в России
        premiereRussia: '12 августа 2021, «Дисней Студиос»',// Премьера в России
        worldPremiere: '10 августа 2021',// Премьера в мире
        age: '18+',
        time: '115 мин. / 01:55',

        acters: "Райан Рейнольдс-Джоди Комер-Лил Рел Ховери-Джо Кири-Уткарш Амбудкар-Тайка Вайтити-Ченнинг Татум-Аарон В Рид-Бритни Олдфорд-Камилль Костек",
        actersN: 131,


        populars: 3,
        views: 2800000,
        rating: 8,
    },
    {
        id: 3,
        engname: 'The Angry Birds Movie 2',
        name: 'Angry Birds 2 в кино',

        src: 'angrybirds2.png',
        srcfull: "angrybirds2moviefull.jpg",
        srcvideo: "3.webm",

        year: '2019',
        country: 'США, Финляндия',
        genres: "Комедия Мультфильм",
        slogan: '«Заклятые друзья?»',
        director: 'Туроп Ван Орман, Джон Райс', // Режиссер
        script: 'Питер Экерман, Эял Поделл, Джонатан Э. Стюарт', // Сценарий
        producer: 'Мэри Эллен Бодер, Джон Клинтон, Джон Коэн, ...', // Продюсер
        operator: 'Tom Bruno Jr., Саймон Дансдон',// Оператор
        composer: 'Эйтор Перейра',// Композитор
        painter: 'Пит Освальд',// Художник
        mounting: 'Кент Бейда, Элли Гаррет',// Монтаж
        budget: '65 000 000 $',
        feesUSA: '41 667 116 $', // Сборы в США
        feesWorld: '+ 106 124 931 $ = 147 792 047 $',   // Сборы в мире
        feesRussia: '9 250 018 $', // Сборы в России
        premiereRussia: '15 августа 2019, «WDSSPR»',// Премьера в России
        worldPremiere: '2 августа 2019',// Премьера в мире
        digitalRelease: '31 октября 2019', // Цифровой релиз
        age: '6+',
        time: '97 мин. / 01:37',


        acters: "Джейсон Судейкис-Джош Гэд-Лесли Джонс-Билл Хейдер-Рэйчел Блум-Аквафина-Стерлинг К. Браун-Эухенио Дербес-Тиффани Хэддиш-Дэнни Макбрайд",
        actersN: 77,

        populars: 4,
        views: 4000000,
        rating: 7.4,
    },
    {
        id: 4,
        name: 'Ёлки 5',

        src: 'elki5.png',
        srcfull: "elki5fullhd.jpg",
        srcvideo: "4.webm",

        year: '2016',
        country: 'Россия',
        genres: "Комедия",
        slogan: '«Начинаем отмечать»',
        director: 'Тимур Бекмамбетов, Вадим Перельман, Индар Джендубаев, ...', // Режиссер
        script: 'Роман Непомнящий, Дмитрий Пинчуков, Вадим Селезнев, ...', // Сценарий
        producer: 'Тимур Бекмамбетов, Мария Затуловская, Ива Стромилова, ...', // Продюсер
        operator: 'Сергей Козлов, Павел Капинос, Владимир Ушаков, ...',// Оператор
        composer: 'Павел Есенин, Юрий Потеенко, Илья Лагутенко, ...',// Композитор
        painter: 'Ирина Гражданкина, Анна Козлова, Елена Жукова, ...',// Художник
        mounting: 'Константин Ларченко, Тим Павелко',// Монтаж
        feesWorld: '13 716 450 $',   // Сборы в мире
        feesRussia: '13 707 638 $', // Сборы в России
        premiereRussia: '22 декабря 2016, «Bazelevs Distribution»',// Премьера в России
        worldPremiere: '23 декабря 2016',// Премьера в мире
        digitalRelease: '20 января 2017, «Базелевс»', // Цифровой релиз
        age: '6+',
        time: '88 мин. / 01:28',

        acters: "Константин Хабенский-Иван Ургант-Сергей Светлаков-Гоша Куценко-Мария Шукшина-Александр Робак-Катерина Шпица-Кирилл Плетнёв-Александр Головин-Александр Домогаров мл.",
        actersN: 53,

        populars: 6,
        views: 1500000,
        rating: 4.8,
    },
    {
        id: 5,
        engname: 'Gemini Man',
        name: 'Гемини',

        src: 'gemini.jpg',
        srcfull: "geminifull.jpg",
        srcvideo: "5.webm",

        year: '2019',
        country: 'США, Китай',
        genres: "Фантастика",
        slogan: '«Кто тебя спасёт от самого себя?»',
        director: 'Энг Ли', // Режиссер
        script: 'Билли Рэй, Дэвид Бениофф, Даррен Лемке', // Сценарий
        producer: 'Джулиана Морено Ангуло, Брайан Белл, Рик Бенаттар, ...', // Продюсер
        operator: 'Дион Биби',// Оператор
        composer: 'Лорн Бэлф',// Композитор
        painter: 'Гай Диас, Джон Коллинз, Роберт Каупер, ...',// Художник
        mounting: 'Тим Скуайрес',// Монтаж
        budget: '138 000 000 $',
        feesUSA: '48 546 770 $',
        feesWorld: '+ 124 922 746 $ = 173 469 516 $',   // Сборы в мире
        feesRussia: '4 897 681 $', // Сборы в России
        premiereRussia: '10 октября 2019, «Централ Партнершип»',// Премьера в России
        worldPremiere: '25 сентября 2019',// Премьера в мире
        digitalRelease: '2 января 2020, «Paramount»', // Цифровой релиз
        age: '12+',
        time: '117 мин. / 01:57',

        acters: "Уилл Смит-Мэри Элизабет Уинстэд-Клайв Оуэн-Бенедикт Вонг-Дуглас Ходж-Ральф Браун-Линда Эмонд-Илья Волох-Э.Дж. Бонилья-Виктор Хьюго",
        actersN: 54,

        populars: 5,
        views: 700000,
        rating: 3.1,
    },
    {
        id: 6,
        engname: 'Sing 2',
        name: 'Зверопой 2',

        src: 'sing2.jpg',
        srcfull: "sing2full.jpg",
        srcvideo: "6.webm",

        year: '2021',
        country: 'США, Япония',
        genres: "Мультфильм Комедия",
        slogan: '«Мечтать не вредно. Вредно не мечтать»',
        director: 'Гарт Дженнингс, Кристоф Лурделе', // Режиссер
        script: 'Гарт Дженнингс', // Сценарий
        producer: 'Джанет Хили, Дана Крупински, Кристофер Меледандри, ...', // Продюсер
        composer: 'Джоби Тэлбот',// Композитор
        painter: 'Гай Диас, Джон Коллинз, Роберт Каупер, ...',// Художник
        mounting: 'Грегори Перлер',// Монтаж
        budget: '85 000 000 $',
        feesUSA: '162 790 990 $',
        feesWorld: '+ 245 611 695 $ = 408 402 685 $',   // Сборы в мире
        audience: '3.7 млн, ...', // Зрители
        feesRussia: '18 574 005 $', // Сборы в России
        premiereRussia: '23 декабря 2021, «UPI»',// Премьера в России
        worldPremiere: '14 ноября 2021',// Премьера в мире
        digitalRelease: '24 февраля 2022, «Universal»', // Цифровой релиз
        age: '6+',
        time: '110 мин. / 01:50',

        acters: "Тори Келли-Риз Уизерспун-Тэрон Эджертон-Ник Кролл-Мэттью Макконахи-Гарт Дженнингс-Дженнифер Сондерс-Челси Перетти-Скарлетт Йоханссон-Бобби Каннавале",
        actersN: 63,

        populars: 7,
        views: 850000,
        rating: 8.3,
    },
    {
        id: 7,
        engname: 'I Am Legend',
        name: 'Я Легенда',

        src: 'IAmLegend.jpg',
        srcfull: "ILegendfull.jpg",
        srcvideo: "7.webm",

        year: '2007',
        country: 'США',
        genres: "Фантастика Ужасы Драма",

        slogan: '«Последний человек на Земле не одинок»',
        director: 'Фрэнсис Лоуренс', // Режиссер
        script: 'Марк Протосевич, Акива Голдсман, Джон Уильям Коррингтон, ...', // Сценарий
        producer: 'Брюс Берман, Дэна Голдберг, Акива Голдсман, ...', // Продюсер
        operator: 'Эндрю Лесни',
        composer: 'Джеймс Ньютон Ховард',// Композитор
        painter: 'Наоми Шохан, Дэвид Лазан, Ховард Каммингс, ...',// Художник
        mounting: 'Уэйн Варман',// Монтаж
        budget: '150 000 000 $',
        feesUSA: '256 393 010 $',
        feesWorld: '+ 328 956 000 $ = 585 349 010 $',   // Сборы в мире
        audience: 'США 37 млн, Великобритания 5 млн, Франция 3 млн, ...', // Зрители
        feesRussia: '9 223 695 $', // Сборы в России
        premiereRussia: '7 февраля 2008, «Каро-Премьер»',// Премьера в России
        worldPremiere: '5 декабря 2007',// Премьера в мире
        DVDRelease: '15 июня 2009, «Юниверсал Пикчерс Рус»',
        BluRayRelease: '20 января 2009, «Юниверсал Пикчерс Рус»',
        age: '18+',
        time: '96 мин. / 01:36',

        acters: "Уилл Смит-Алиси Брага-Чарли Тахэн-Салли Ричардсон Уитфилд-Уиллоу Смит-Даррел Фостер-Эйприл Грэйс-Дэш Майок-Джоанна Нумата-Abbey",
        actersN: 112,

        populars: 8,
        views: 950000,
        rating: 7.9,
    },
    {
        id: 8,
        engname: 'Kung Fu Panda 4',
        name: 'Кунг-фу Панда 4',

        src: 'KyngFuPanda4(3_4).jpg',
        srcfull: "kungfupanda4full.jpg",
        srcvideo: "8.webm",

        year: '2024',
        country: 'США, Китай',
        genres: "Мультфильм Фантастика Комедия",

        slogan: '—',
        director: 'Майк Митчелл, Стефани Стайн', // Режиссер
        script: 'Джонатан Айбел, Гленн Бергер, Даррен Лемке, ...', // Сценарий
        producer: 'Джонатан Айбел, Гленн Бергер, Ребекка Хантли, ...', // Продюсер
        composer: 'Стив Маццаро, Ханс Циммер',// Композитор
        painter: 'Пол Дункан',// Художник
        mounting: 'Кристофер Найтс',// Монтаж
        budget: '85 000 000 $',
        feesUSA: '173 720 725 $',
        feesWorld: '+ 279 271 000 $= 452 991 725 $',   // Сборы в мире
        worldPremiere: '2 марта 2024',// Премьера в мире
        age: '6+',
        time: '94 мин. / 01:34',

        acters: "Джек Блэк-Аквафина-Виола Дэвис-Дастин Хоффман-Брайан Крэнстон-Джеймс Хун-Иэн Макшейн-Ке Хюи Куан-Ронни Чиэн-Лори Тань Чинн",
        actersN: 37,

        populars: 9,
        views: 2000000,
        rating: 6.7,
    },
    {
        id: 9,
        engname: 'Barbie',
        name: 'Барби',

        src: 'Barbie.jpg',
        srcfull: "barbiefull.jpg",
        srcvideo: "9.webm",

        year: '2023',
        country: 'США, Великобритания',
        genres: "Фантастика Комедия",

        slogan: '«Она — всё, чего только можно пожелать. Он — просто Кен»',
        director: 'Грета Гервиг', // Режиссер
        script: 'Грета Гервиг, Ноа Баумбак', // Сценарий
        producer: 'Том Акерли, Кейт Адамс, Ноа Баумбак, ...', // Продюсер
        operator: 'Родриго Прието',
        composer: 'Марк Ронсон, Эндрю В. Блейкмор',// Композитор
        painter: 'Сара Гринвуд, Эндрю Макс Кан, Дин Клегг, ...',// Художник
        mounting: 'Ник Хюи',// Монтаж
        budget: '100 000 000 $',
        audience: '20 903 961',
        feesUSA: '636 238 421 $',
        feesWorld: '+ 809 400 000 $ = 1 445 638 421 $',   // Сборы в мире
        worldPremiere: '18 июля 2023',// Премьера в мире
        age: '13+',
        time: '114 мин. / 01:54',

        acters: "Марго Робби-Райан Гослинг-Америка Феррера-Ариана Гринблатт-Кейт МакКиннон-Исса Рэй-Уилл Феррелл-Майкл Сера-Симу Лю-Александра Шипп",
        actersN: 188,

        populars: 10,
        views: 7000000,
        rating: 6.6,
    },
    {
        id: 10,
        name: 'Чебурашка',

        src: 'Cheburaska.jpg',
        srcfull: "cheburashkafull.jpg",
        srcvideo: "10.webm",

        year: '2022',
        country: 'Россия',
        genres: "Комедия",
        slogan: '—',

        director: 'Дмитрий Дьяченко', // Режиссер
        script: 'Василий Куценко, Вячеслав Зуб, Анатолий Молчанов, Виталий Шляппо', // Сценарий
        producer: 'Эдуард Илоян, Виталий Шляппо, Денис Жалинский, ...', // Продюсер
        operator: 'Иван Лебедев, Игорь Гринякин',
        composer: 'Иван Канаев',// Композитор
        painter: 'Фёдор Савельев, Артём Кузьмин, Мария Муратова',// Художник
        budget: '850 млн ₽',
        feesWorld: '7 045 716 550 ₽',   // Сборы в мире
        worldPremiere: '23 декабря 2022',// Премьера в мире
        age: '6+',
        time: '113 мин. / 01:53',

        acters: "Сергей Гармаш-Ольга Кузьмина-Елена Яковлева-Фёдор Добронравов-Сергей Лавыгин-Полина Максимова",
        actersN: 100,

        populars: 11,
        views: 5000000,
        rating: 7.3,
    }]
